//
// workbook-01.js
// 問題番号：01 ~ 09
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q01 = () => {
  // ----------------------------------------
  // 01. 「Hello World!」を表示する
  // ----------------------------------------
  console.log(`01. 「 Hello World! 」を表示する`);
  console.log("たくとのばか")




};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q02 = () => {
  // ----------------------------------------
  // 02. 「EC」と「C」を連結して「ECC」を表示する
  // ----------------------------------------
  //console.log(`02. 「 EC 」と「 C 」を連結して「ECC」を表示する`);
  var a = "EC"
  var b = "C"
  console.log(a + b)




}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q03 = () => {
  // ----------------------------------------
  // 03. データの入力と表示
  // ----------------------------------------
  // console.log(`03. 好きなメッセージを入力し、コンソールに表示する`);

  var a = prompt(`Q03. メッセージを入力`);
  console.log(a)
  
}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q04 = () => {
  // ----------------------------------------
  // 04. ２つの数値を入力して、その合計を表示する
  // ----------------------------------------
  //console.log(`04. ２つの数値を入力して、その合計を表示する`);

  var num1 = parseInt(prompt(`Q04. １つ目の数値を入力`));
  var num2 = parseInt(prompt(`Q04. ２つ目の数値を入力`));
  console.log(num1 + num2)



}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q05 = () => {
  // ----------------------------------------
  // 05. ２つの数値を入力して、その余りを表示する
  // ----------------------------------------
  console.log(`05. ２つの数値を入力して、その余りを表示する`);

  var num1 = parseInt(prompt(`Q05. １つ目の数値を入力`));
  var num2 = parseInt(prompt(`Q05. ２つ目の数値を入力`));
  console.log( num1 + " % " + num2 + " = " + (num1 % num2))


}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q06 = () => {
  // ----------------------------------------
  // 06. 2つの整数値を入力して、その和・差・積・商と余りを表示する
  // ----------------------------------------
  console.log(`06. 2つの整数値を入力して、その和・差・積・商・余を表示する`);

  var num1 = parseInt(prompt(`Q06. １つ目の数値を入力`));
  var num2 = parseInt(prompt(`Q06. ２つ目の数値を入力`));
  console.log("１つ目の数値:" + num1)
  console.log("２つ目の数値:" + num2)
  console.log("和:" + (num1 + num2))
  console.log("差:" + (num1 - num2))
  console.log("積:" + (num1 * num2))
  console.log("商:" + (num1 / num2))
  
}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q07 = () => {
  // ----------------------------------------
  // 07. 消費税の計算
  // ----------------------------------------
  console.log(`07. 金額と消費税率を入力して、消費税の金額をコンソールに表示する`);

  let num1 = parseInt(prompt(`Q07. 金額を入力`));
  let num2 = (parseInt(prompt(`Q07. 消費税率を入力（%）`))/100);
  console.log("金額:" + num1)
  console.log("消費税:" + (num1 * num2 ))

}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q08 = () => {
  // ----------------------------------------
  // 08. 円の面積
  // ----------------------------------------
    //console.log(`08. 半径を入力して、円の面積をコンソールに表示する`);

  var num1 = parseInt(prompt(`Q08. 円の半径を入力`));
  console.log("面積は " + num1 * num1 * 3.14)
  


}

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q09 = () => {
  //
  // 09. 小数点の桁数指定
  //
  console.log(`09. ２つの整数を入力して、その除算結果と小数点以下第２位までに丸めた結果をコンソールに表示する`);

  var num1 = parseInt(prompt(`Q09. １つ目の数値を入力`));
  var num2 = parseInt(prompt(`Q09. ２つ目の数値を入力`));
  console.log((num1 / num2).toFixed(2))



}

